#+TODO: TODO WORKING FINISHED | SUBMITTED CANCELED MISSED
#+FILETAGS: :@school:

*** SUBMITTED [#A] is_pangram assignment
DEADLINE: <2020-02-27 Thu>
:LOGBOOK:
CLOCK: [2020-02-20 Thu 15:49]--[2020-02-20 Thu 16:55] =>  1:06
:END:
*** SUBMITTED Array assignment
DEADLINE: <2020-03-04 Wed>
:LOGBOOK:
CLOCK: [2020-02-23 Sun 18:00]--[2020-02-23 Sun 18:45] =>  0:45
:END:
*** SUBMITTED Assignment using Pointers
DEADLINE: <2020-03-08 Sun>
:LOGBOOK:
CLOCK: [2020-03-07 Sat 16:53]--[2020-03-07 Sat 17:58] =>  1:05
:END:
unsigned int sum = 0x89ABCDEF;

  umsigned int iData [  ] = {  0xFF00FF15, 0xFF00FF14, 0xFF00FF13, 0xFF00FF12 } ;

  unsigned int *Ptr1 , *Ptr2; 

 

1.   Ptr1 =   _____  sum ;  

Fill in the blank,  I need Ptr1 point to sum

Answer :  Ptr1 = &sum

 

2.    printf ( "  %#x  ",    ____ Ptr1 ) ;  // Fill in the blank , I need to dereference to print

      Answer :  printf(" %#x ", *Ptr1);

  

3.    Ptr2 = _________ ; 

      Fill in the blank ,  I need Pr2 point to the array iData

      Answer : Ptr2 = iData;

 

4.   printf ( " %#x ",   *Ptr2 ) ;  .// what does it print now

      Answer : 0xFF00FF15

 

Then,  I am incrementing the pointer Ptr2 like this statement below.

Ptr2++ ;  

 

5.   printf ( " %#x ",   *Ptr2 ) ;  .// what does it print now
0xFF00FF14
 

Then,  I am incrementing sPtr2 again twice like this statement below. 

Ptr2++ ; 

Ptr2++ ; 

 

6.  printf ( " %#x ",   *Ptr2 ) ;  .// what does it print now 
0xFF00FF12
 

Let us now have this statement below.  make Ptr2 point to Ptr1.  

Ptr2 = Ptr1 ;

 

7.  printf ( " %#x ",   *Ptr2 ) ;  .// what does it print now 
0x89ABCDEF
 

 

//  now consider this   , answer question 8 and 9 

unsigned int y = 0x89AB45CD ;

Ptr1 = &y ;   

Ptr2   =   Ptr1 ;

 

 

8.   printf ( "  %#x \n  ", * Ptr1 ) ;  .// what does it print 
0x89AB45CD
 

9.  printf ( "  %#x \n  ", *Ptr2 ) ;  .// what does it print 
0x89AB45CD
 

10.   

y = 0x45CD89AB ;

printf ( "  %#x \n  ", * Ptr1 ) ;  .// what does it print 

0x45CD89AB ;
 

 

// consider this and answer Question 11 and 12

Ptr2 =  iData + 2 ;

Ptr1 = Ptr2  ;

   

11.  printf ( "  %#x  ",   * Ptr1 ) ;  .// what does it print
0xFF00FF13
 

Ptr2 =  iData + 1 ;

12.  printf ( " %#x  " ,   *  Ptr2 ) ;  .// what does it print
0xFF00FF14
 

 

// we are then defining a new array,  answer Question 13 and 14 

 

unsigned short   dataBuf [ 4 ]  =  {  0xFF00, 0x0F0E, 0xdead, 0xbeef}  ;

 

13.    Is the next statement correct ?

dataBuf++   ;
No, you can't reassign arrays


14:   Is the next statement correct ?

dataBuf =  20 ;    
No, you can't reassign arrays
    

 

 

  Consider the below statements and answer question 15 and Question 16 

   unsigned char count ;

 

   

Question 15. What is the problem with that statement ? 

  unsigned char \*extraPtr1 = 10 ;   // Question 15 
  Can't assign integer to variable of type char\*

 

Question 16. What is the problem with that statement ? 

unsigned char extraPtr2 =  &count ;     
Can't assign pointer to variable of type unsigned char

 

 

Consider this and answer Question 17 and 18

 unsigned short sh ;

   

  17:  is that a good  statement  ? 

   unsigned short \*shortPtr1 = sh  ;   //  Question 17
   No, you're trying to assign an (uninitialized) unsigned short to a variable of type unsigned short\*

 
18:  is that a good  statement  ? 

   unsigned short \*shortPtr2 = &sh  ;   // Question 18
   This looks fine, you're assigning a pointer to an unsigned short to a variable of type unsigned short\*.

 

 

 

 

 

// consider these statements below and answer 19 - 20 .

         unsigned int numData [ 10 ] = { 0x19, 0xFF12FF13, 0xFF00FF12, 0x43, 0x87, 0x34 } ;

          int *numPtr = numData + 1 ;

          numPtr  = numPtr + 1 ;

 

19: 

  what is the value  *numPtr ;   
  0xFF00FF12

 

 20.        *numPtr = *numPtr + 20 ;
 0xFF00FF26

what is the value of *numPtr;
*** SUBMITTED Using Pointers and Array
DEADLINE: <2020-03-14 Sat>
:LOGBOOK:
CLOCK: [2020-03-07 Sat 18:01]--[2020-03-07 Sat 19:27] =>  1:26
:END:
[[file:~/dev/60/pointers_array_assignment/pointers_arrays.c][C file]]
**** SUBMITTED [#A] Do all required readings
DEADLINE: <2020-02-26 Wed>
:LOGBOOK:
CLOCK: [2020-02-26 Wed 20:42]--[2020-02-26 Wed 21:06] =>  0:24
CLOCK: [2020-02-24 Mon 21:30]--[2020-02-24 Mon 22:08] =>  0:38
CLOCK: [2020-02-24 Mon 13:31]--[2020-02-24 Mon 16:09] =>  2:38
CLOCK: [2020-02-23 Sun 20:57]--[2020-02-23 Sun 22:27] =>  1:30
:END:
**** SUBMITTED [#A] Long Reply
DEADLINE: <2020-02-26 Wed>
:LOGBOOK:
CLOCK: [2020-02-26 Wed 21:12]--[2020-02-26 Wed 22:22] =>  1:10
:END:
Does the nature of capitalism suggest it is incompatible with a just society?

Long Reply: 3 Capitalism is not fundamentally incompatible with a just society, but it does carry inherent risks which could potentially lead to injustice.

Fundamentally, capitalism as a system consisting of private ownership and voluntary exchange is not incompatible with a just society. The voluntary exchange element is particularly unimpeachable. One could simply state the meaning of the word 'justice' as the ideal that people should get what they deserve, and that infringing upon the autonomy of others should have consequences. Under this definition, any system that inherently guarantees autonomy over the exchange of personal goods is at least just to the extent that other elements of it are not unjust. The principle of private ownership is the element of capitalism that has the most potential to cause injustice. It is easy to imagine ways that arbitrary rules of ownership may potentially limit the autonomy of those who fail to satisfy those rules. If one were to imagine, for example, a system where all property were privately owned by local lords without the means for serfs to gain property of their own, the system in question could hardly be called one which preserves personal autonomy. The lords may be well within their legal rights to own the property that they do, which illuminates a fundamental pitfall associated with private ownership; How is property to be justly distributed? What can (or should) be done to prevent the accumulation of wealth by the few at the expense of the many? The difficulty with this problem is that any answer would run the risk of interfering with the price system, which is, at least theoretically, a very effective vehicle for ensuring the most efficient use of scarce resources. Most of us would agree that property *should* be owned by those who earn it via their hard work, intelligence, insight, perseverance, etc. The very nature of the right to transfer or exchange property at will (a fundamental aspect of ownership) makes that ideal extremely difficult to achieve, however. If individuals are free to transfer property at will, they will have the ability to transfer wealth to those have not earned it. Those individuals who have received wealth without earning it then have a competitive advantage over those who have to begin earning their wealth from nothing. It may be argued that people getting what they don't deserve doesn't mean that others can't get what they do deserve, but this is only true to an extent. It's conceivable that there is some point where an amount of hoarded wealth in the hands of small subset of the population could possibly overcome the benefits of the 'positive-sum' nature of markets. (7)

Historically, it's easy to see examples of this situation in action. In the not-so-distant history of our country, there was a time contemptuously referred to as 'the gilded age.' From around the 1870's to about 1900, rapid economic growth and monopolization resulted in an era that has been metaphorically compared to something that is covered in a thin layer of gold, but is essentially worthless under the surface. Many have referred to some capitalists of the day as Robber Barons, so called for the unethical and oppressive (i.e. ostensibly unjust) methods that they used to accumulate wealth. According to the laws of the time, those individuals were only exercising their right to ownership and voluntary exchange to their advantage, but the effects of that were catastrophic for the enormous amount of impoverished citizens of the time. The situation highlights the idea that while the so-called robber barons may have voluntarily exchanged their time and effort for wealth, the poor were so limited in options that it would be a stretch to call what they needed to do to survive 'voluntary.' Is an exchange truly voluntary if the only alternative for one party is starvation or homelessness? Arguably, this situation may have been more the result of monopoly than capitalism, but it highlights the risk of monopoly that might be inherent in capitalism without government oversight. It also illustrates the danger that a firm seeking increased profits might try to do so by influencing government policies to serve their interest. Even though the gilded age came to end, it raises concerns about the possibility of corporations again using their vast resources to increase their wealth at the expense of the general public. (1)
**** SUBMITTED [#A] Do all required readings
DEADLINE: <2020-03-04 Wed>
:LOGBOOK:
CLOCK: [2020-03-04 Wed 20:55]--[2020-03-04 Wed 21:37] =>  0:42
CLOCK: [2020-03-04 Wed 13:58]--[2020-03-04 Wed 18:07] =>  4:09
CLOCK: 
:END:
**** SUBMITTED [#A] Long Reply
DEADLINE: <2020-03-04 Wed>
:LOGBOOK:
CLOCK: [2020-03-04 Wed 21:37]--[2020-03-04 Wed 21:59] =>  0:22
:END:
Long Reply: 6 There are elements and consequences relating to capitalism that are incompatible with a just society.

In it's purist and most simplistic form, the arguments for capitalism are compelling. The price system certainly appears to be marvelously efficient and fair. Voluntary exchange of property seems completely aligned with justice and morality. From an efficiency perspective, it's hard to find a compelling argument against capitalism, and if efficiency means more for everyone according to their hard work, daring, intelligence, etc., that certainly sounds like justice to me. I think the issues that present themselves over time in capitalist societies are results of certain 'externalities,' or effects upon those beyond the two parties who have voluntarily entered into an agreement. The Corporation documentary made some compelling points about the motivations of corporations under our current legal framework. Corporations are legally required to protect the interests of their shareholders above all others, which can have disastrous consequences. It could be argued that a truly competitive market will punish a corporation for externalities, but I'm unconvinced. Let's imagine two paper manufacturing corporations, PaperCo and Nestree. They've both been dumping waste into a local river for years, and even though it's killed all the fish and poisoned the local ecosystem, people don't seem to care enough to make the connection to the paper products they buy. One day, the CEO of Nestree starts to feel bad about all the dead fish and waterfowl, and decides that instead of dumping, they'll pay a waste disposal company to get rid of their waste in a sustainable way. Unfortunately, that costs quite a bit more than dumping, so Nestree is forced to raise the prices on their paper products in a noticeable way. They make sure to include on their packaging that they're doing some good work for the environment, but will that be enough to keep them in competition with the other companies? That seems unlikely to me. If the majority of consumers will willing to pay higher prices for goods that were better for the environment, we'd already have seen eco-friendly corporations taking over all manner of industries. Sadly, it appears to be some fundamental part of human nature that if person A has a deal with person B that they're happy with, they won't really be bothered if that deal has the potential to cause some harm to person C a few thousand miles away. Because of this fundamental aspect of human nature, any corporation who significantly raises prices or lowers quality to make sure that person C isn't harmed will not be able to compete with the companies who don't. Profit margins are already razor thin in highly competitive markets, there is very little room for including aspects of a deal that don't have any impact on the bottom line, and there is very little evidence that out-of-sight externalities have any impact on the bottom line for the majority of companies. In my mind, this is fundamentally unjust, and therefor is incompatible with a just society. Despite this, I don't believe the current climate of 'corporations are people' and 'protect profits or go to jail' is the only climate in which capitalism can exist. My mind is open to the idea that there may be solutions to these issues that still allow for capitalism to bring its benefits to our society. (5)

It's another issue entirely that minorities in terms of race and class are disproportionately impacted by these externalities. To the extent that consumers do have the ability to impact corporate decisions, it's the average consumer that has that power. Corporations care when a majority of their customers are looking for change, but they are not particularly interested when a small subset of the population is being negatively impacted by their behaviors. For minorities, this poses a real problem. Minorities may have needs, issues or experiences that are unique to them, but rarely have the collective power to 'vote with their wallets.' This can result in a situation where minorities have no real voice in corporate behavior, and can become that 'person C' that is impacted negatively by deals between the majority and corporations.(3)
**** SUBMITTED [#A] Medium and Short Replies
DEADLINE: <2020-03-07 Sat>
:LOGBOOK:
CLOCK: [2020-03-07 Sat 15:07]--[2020-03-07 Sat 16:50] =>  1:43
:END:
Medium Reply
Approach C: Interesting
Hey Sophia,
C1: I think you made some really interesting points here. One of the big things that stuck out to me was you talking about money circulating through the economy regardless of whether it's spent by consumers, saved by consumers, or spent by corporations. That's something that's been on my mind during these readings, particularly during Bastiat's essay. One increasingly hot topic in politics today is the potential for negative consequences of having ultra-wealthy business people. Many would claim (and I'm inclined to believe) that there is some harm to society caused by the skyrocketing wealth of a few and the stagnating wealth of the working class. It's an interesting point to think about "what's not seen," and how that relates to the investments and purchases of corporations that we may be inclined to distrust because of their wealth.

C2: One concern that I think should be considered is the question of whether wealth in the hands the corporations and the rich actually does 'spend the same' as wealth more evenly distributed. One argument I've heard is that large corporations and the super-wealthy don't necessarily fund smaller businesses, especially local ones, the way the same wealth would in the hands of regular, everyday people. Simply put, if you or I had an extra $200 per month, we'd probably go to the movies a little bit more, maybe get our hair cut more often, go to more restaurants, etc. The argument is that if someone is worth $30 billion, that $200 per month is unlikely to increase the amount of regular goods and services that they purchase.

C3: I'm not completely convinced by this argument, but I do believe that it presents a question that should be answered. According to Bastiat, that person worth $30 billion will still take that $200 and either save, spend or give it away, which will allow someone, somewhere to go to the movies a few extra times, or get an extra haircut. As a society, there will still be the same number of benefits produced. Despite this, it could be considered a negative that a disproportionate number of those 'satisfactions' go to the shrinking percentage of those with extravagant wealth.

C4: In order to be convinced either way, as with most arguments, I'd want to see some concrete data. I'd be interested in the results of a study that examined the different ways that different socioeconomic classes of individuals, and corporations, contributed to local economies and the economy as a whole.

Joe

Short Reply
Hey Sophia,
Honestly, I'm right with you how you say that there are two valid sides to this issue. I appreciate how you pointed out that corporations seem to be getting better about environmental and animal treatment externalities, but I'm a little concerned that the positive changes we're seeing are just more marketing. Hopefully we can find a solution that results in externalities having an impact on corporations' bottom lines, because I think that's the only way they'll genuinely care about them.

Joe

Medium Reply
Approach B: Agree
Hey Ryan,
B1: I agree that the evidence that we can see around us in the US today suggests that there are some fundamentally unjust elements of capitalism. The most obvious criticism of this viewpoint is that the injustices are not caused by capitalism itself, but are caused by market failures that are a result of overzealous regulation. According to those who hold these views, as long as there is competition, consumers will be able to punish immoral corporations by not supporting them, causing harm to their profits.

B2: While I think there are merits to this argument, I'm not convinced that it represents every cause of injustice under capitalism. As you (and our readings) suggested, a corporation is highly incentivized to pursue profits at the expense of anything else. There are an innumerable number of ways that a corporation can control their image, hiding unethical behaviors from consumers and therefore protecting their profits. If it is more profitable for a corporation to participate in a harmful behavior and hide it than it is to substitute the harmful behavior for a harmless one, any good corporation under capitalism will almost certainly continue in the harmful behavior. Even if they seem to be making strides on the surface to reduce externalities, it is more than likely that what the consumer sees is only a calculated public relations strategy, and that the corporation really has no commitment to ethical behavior. Unfortunately, this seems to be a necessary truth due to 'shareholder rights' in the US, which can hold a corporation legally responsible for choosing ethics over profits, and thereby robbing shareholders of the largest possible return on their investments.

Joe

Medium Reply
Approach A: Problematic
Hey Elaf,
A3: I think you make some good points, but there is one thing that you may have failed to consider. I agree that a fundamental part of any just society is that hard work is rewarded and that we're free from government control, but I'm not sure that capitalism always ensures those things. Regarding hard work, it certainly seems to me that US capitalism at least may not be treating everyone equally. It's not uncommon for someone to be extremely wealthy due to connections or financial help provided by wealthy parents. On the other hand, our country is full of single parents who work themselves to the bone, with little to show for it. Even in education, we see the difference in classes of students. Many students have to support themselves, which, if they don't take loans, requires them to work dozens of hours per week to stay alive and housed. Compared to their peers who are supported by wealthy parents, these students are at an enormous competitive disadvantage. They are more likely to be unable to participate in clubs and extracurriculars due to scheduling conflicts, they have less time to study and work on projects, and we can't ignore the mental health risks that come from having little to no time for recreation. These students may work significantly harder than an arbitrary student who's being supported, and yet get passed over for internship and employment opportunities due to poorer grades and lack of extracurricular activities. This situation is an unavoidable side-effect of the 'freedom to transfer' right of ownership of property that is part of capitalism.

Joe

Short Reply
Hey Matthew,
One thing that I really liked about your remarks is how you pointed out that under capitalism, corporations tend towards domination. If I'm not mistaken, that has a lot in common with one of Karl Marx's main criticisms of capitalism, namely the runaway-train accumulation of capital in the hands of a few. We have on our hands a system where there is huge incentive to accumulate wealth. This dynamic combines with the fundamental fact that under capitalism, the more wealth you have, the easier it is to generate more wealth to produce the problem that you mentioned. Without some force to apply an upper-limit to the amount of wealth that be consolidated under one individual (biological or legal), it is a reasonable concern that the consolidation of wealth could become a problem eventually.

Joe

Short Reply
Hey Emanuel,
I like that you pointed out that how successful those large businesses are, even though they're unethical. Unfortunately, consumers don't have a reliable way to access the information that they'd need to truly hold corporations accountable. Additionally, as you mentioned, the income inequality in our society has been worsening. It's easy to understand how a consumer may not have the head-space to worry about oppressed workers in south America when they're just trying to figure out how to make a paycheck cover expenses. It's hard to worry about people on the other side of the world when you're basic needs aren't being met. Additionally, there's a cost associated with shopping at places that at least market themselves as ethical alternatives, and someone who struggles to make ends meet might not be able to afford the premium.
Joe

**** SUBMITTED [#A] Do all required readings
DEADLINE: <2020-03-11 Wed>
:LOGBOOK:
CLOCK: [2020-03-11 Wed 18:30]--[2020-03-11 Wed 20:24] =>  1:54
CLOCK: [2020-03-09 Sat 17:34]--[2020-03-09 Sat 19:44] =>  2:10
CLOCK: [2020-03-07 Sat 19:34]--[2020-03-07 Sat 19:44] =>  0:10
:END:
**** SUBMITTED [#A] Long Reply
DEADLINE: <2020-03-11 Wed>
:LOGBOOK:
CLOCK: [2020-03-11 Wed 20:57]--[2020-03-11 Wed 21:15] =>  0:18
:END:
Long Reply: 3 The activity of corporations doesn't suggest that capitalism is entirely incompatible with a just society, but there are considerations that must go into making it so.

PW: Fundamentally, corporations will always act in a way that furthers their own interests. In practice, this can be a double-edged sword. When the interests of corporations align with the interests of society, they can be an enormous positive force because of their efficiency. In this scenario, capitalism has significant advantages over centrally planned economic systems in advancing the standard of living of all participants. The caveat to this is that when it becomes more profitable for a corporation to act in an unjust way, they will be compelled to do so under capitalism. This can be mitigated through thoughtful state intervention, but that must be done extremely carefully. Applying artificial forces (like those that come from state intervention) into the market has the potential to upset the balance of profitability that makes capitalism an advantageous economic system in the first place. (5)

GED: Personally, I found Long's article to be an interesting explanation of the philosophy of the deregulation of markets. Prior to reading it, I fell into the camp that he described as those who view individuals who advocated for deregulation with a high level of suspicion. In my mind, the only ones who benefited from relaxation of regulations were corporations and their shareholders. I hadn't realized that a dislike for anti-competitive business practices was exactly the idea that motivates many of those individuals. I'm still convinced that many regulations are important and effective, and I'm aware that many corporations fight tooth-and-nail to have the ones they dislike overturned. I'm now aware that it's also possible to seek for some deregulation for the exact opposite reason of protecting corporate interests. It's an interesting thought that perhaps the best way of regulation some behaviors is by forcing corporations to compete with each other for customers. (4)

Joe 
